       IDENTIFICATION DIVISION.
       program-id. decimal.
       
       ENVIRONMENT DIVISION.
       configuration section.

       DATA DIVISION.
       file section.
       working-storage section.
       
       PROCEDURE DIVISION.

       STOP RUN.
